foam/programming-openfoam/day-3/pitzDaily/system/energy
// Description
//    Writes kinetic energy of the entire domain 

type  energy;
libs  ("libenergyFunctionObject.so");
rho   1.2;
